Estes exercícios são baseado no conjunto de dados de desastre do Titanic disponível no [Kaggle](https://www.kaggle.com/c/titanic). Para saber mais sobre as variáveis verifique [aqui](https://www.kaggle.com/c/titanic/data).

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [ ]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

titanic = pd.read_csv(url)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 1. Defina `PassengerId` como o índice

#### Crie um gráfico de pizza apresentando a proporção masculino / feminino

#### 2. Crie um gráfico de dispersão com a Tarifa paga e a Idade, diferencie a cor do gráfico por gênero

#### 3. Crie um histograma com a tarifa paga

#### 4. Faça um gráfico de linha de X e Y

Embora o resultado contenha todas as informações que gostaríamos que ele transmitisse, ele o faz de uma forma que não é tão esteticamente agradável e até parece um pouco antiquado no contexto da visualização de dados do século XXI.

Agora vamos dar uma olhada em como isso funciona com o Seaborn. Como veremos, o Seaborn tem muitas de suas próprias rotinas de plotagem de alto nível, mas também pode sobrescrever os parâmetros padrão do Matplotlib e, por sua vez, obter até mesmo scripts simples do Matplotlib para produzir uma saída amplamente superior. Podemos definir o estilo chamando o método set () da Seaborn. Por convenção, Seaborn é importado como sns:

In [ ]:
import seaborn as sns
sns.set()

In [ ]:
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

#### 5. Faça um `pairplot()`